/*******************************************************
*Copyright(C),2020,Shanghai Eastsoft Microelectronics Co.,Ltd.
*文件名：timer.c
*作  者：AE Team
*版  本：v1.0
*日  期：2020/07/09
*描  述：T8N定时器定时模式，PA1输出方波，周期2s
*备  注：本软件仅供学习和演示使用，对用户直接引用代码所带来的风险或后果不承担任何法律责任。
*******************************************************/
#include <hic.h>

#define CLRWDT()   {__Asm CWDT;}        //宏定义清狗指令

unsigned char timer_cnt;

/******************************************************
函数名：void RAMclear(void)
描  述：RAM区数据清零，RAM区地址0x0000~0x03FF
输入值：无
输出值：无
返回值：无
*******************************************************/
void RAMclear(void)
{
    for (IAAH=0; IAAH<=0x03; IAAH++)
    {
        for (IAAL=0; IAAL<0xFF; IAAL++)
            IAD = 0x00;
        IAD = 0x00;
    }
}

/******************************************************
函数名：void GPIOInit(void)
描  述：首先初始化所有未用到的IO口为输出低电平
输入值：无
输出值：无
返回值：无
*******************************************************/
void GPIOInit(void)
{
    ANSL = 0xFF;        //选择对应端口为数字IO功能
    ANSH = 0xFF;       
    PAT = 0x00;         //所有IO设为输出低电平
    PBT = 0x00;
    PCT = 0x00;
    PA = 0x00;
    PB = 0x00;
    PC = 0x00;
}

/*******************************************************
函数名：void isr(void) interrupt
描  述：中断服务程序
输入值：无
输出值：无
返回值：无
*******************************************************/
void isr(void) interrupt
{
    if (T8NIE==1 && T8NIF==1)        //定时器溢出中断
    {
        T8NIF = 0;        //清标志位

        T8N += 6;         //进中断先赋计数器初值
        timer_cnt ++;
        if (timer_cnt >= 250) 
        {
            timer_cnt = 0;
            PA1 = ~PA1;
        }
    }
}

/*******************************************************
函数名：void main(void)
描  述：主函数，1s溢出翻转PA1电平
输入值
输出值：无
返回值：无
*******************************************************/
void main(void)
{
    RAMclear();
    GPIOInit();
    timer_cnt = 0;
    T8NC = 0x0E;         //定时器模式，预分频1:(Fosc/2)/128
    T8N = 6;             //赋计数器初值
    T8NIE = 1;           //打开定时器溢出中断
    T8NIF = 0;           //清溢出标志位
    GIE = 1;             //开全局中断
    T8NEN = 1;           //使能T8N
    while (1)
    {
        CLRWDT();
    }
}