/*******************************************************
*Copyright(C),2020,Shanghai Eastsoft Microelectronics Co.,Ltd.
*文件名：compare_square_output.c
*作  者：AE Team
*版  本：v1.0，编译于iDesigner(v4.2.3.166) + 工具链HRCC(v1.2.0.106)
*日  期：2020/07/07
*描  述：多功能定时器方波输出模式，T31_CH1N(PB2)输出方波，PB0高电平时T31_CH1N输出低
*备  注：本软件仅供学习和演示使用，对用户直接引用代码所带来的风险或后果不承担任何法律责任。
*******************************************************/
#include <hic.h>

#define CLRWDT()   {__Asm CWDT;}        //宏定义清狗指令

/******************************************************
函数名：void RAMclear(void)
描  述：RAM区数据清零，RAM区地址0x0000~0x03FF
输入值：无
输出值：无
返回值：无
*******************************************************/
void RAMclear(void)
{
    for (IAAH=0; IAAH<=0x03; IAAH++)
    {
        for (IAAL=0; IAAL<0xFF; IAAL++)
            IAD = 0x00;
        IAD = 0x00;
    }
}

/******************************************************
函数名：void GPIOInit(void)
描  述：首先初始化所有未用到的IO口为输出低电平
输入值：无
输出值：无
返回值：无
*******************************************************/
void GPIOInit(void)
{
    ANSL = 0xFF;        //选择对应端口为数字IO功能
	ANSH = 0xFF;        //选择对应端口为数字IO功能
    PAT = 0x00;         //所有IO设为输出低电平
    PBT = 0x00;
    PCT = 0x00;
    PA = 0x00;
    PB = 0x00;
    PC = 0x00;

    PBT0 = 1;           //T31_ETR设为输入
    PBPD0 = 1;          //使能下拉
}

/*******************************************************
函数名：void main(void)
描  述：主函数，T31_CH1N(PB2)输出方波，PB0高电平时T31_CH1N输出低
输入值：无
输出值：无
返回值：无
*******************************************************/
void main(void) 
{
    RAMclear();
    GPIOInit();
    T31C0L = 0x00;        //边沿计数模式，向上计数
    T31C2L = 0x08;        //禁止从模式,使能外部事件清除OCnREF
    T31CH1C = 0xB0;       //使能输出比较1清零，计数器匹配T31CH1R时翻转OC1REF，CC1通道配置为输出 
    T31PINCL = 0x04;      //OC1N通道高电平有效，使能输出
    T31PRSH = 0x00;       //预分频系数1:16
    T31PRSL = 0x0F;
    T31CNTLDH = 0x01;     //重装载值，方波周期=T31CNTLD*2*分频后的时钟周期
    T31CNTLDL = 0xF4;
    T31CH1RH = 0x00;      //比较寄存器1值
    T31CH1RL = 0x08;
    CHOE = 1;           //输出使能
    T31EN = 1;          //使能计数器
    while (1)
    {
        CLRWDT();
    }
}