/*******************************************************
*Copyright(C),2020,Shanghai Eastsoft Microelectronics Co.,Ltd.
*文件名：capture_input.c
*作  者：AE Team
*版  本：v1.0，编译于iDesigner(v4.2.3.166) + 工具链HRCC(v1.2.0.106)
*日  期：2020/07/07
*描  述：多功能定时器输入捕捉模式，T31_CH1(PB5)下降沿捕捉，捕捉成功翻转PA1
*备  注：本软件仅供学习和演示使用，对用户直接引用代码所带来的风险或后果不承担任何法律责任。
*******************************************************/
#include <hic.h>

#define CLRWDT()   {__Asm CWDT;}        //宏定义清狗指令

unsigned int ch1rvalue;        //变量保存捕捉时锁存到捕获寄存器的值

/******************************************************
函数名：void RAMclear(void)
描  述：RAM区数据清零，RAM区地址0x0000~0x03FF
输入值：无
输出值：无
返回值：无
*******************************************************/
void RAMclear(void)
{
    for (IAAH=0; IAAH<=0x03; IAAH++)
    {
        for (IAAL=0; IAAL<0xFF; IAAL++)
            IAD = 0x00;
        IAD = 0x00;
    }
}

/******************************************************
函数名：void GPIOInit(void)
描  述：首先初始化所有未用到的IO口为输出低电平
输入值：无
输出值：无
返回值：无
*******************************************************/
void GPIOInit(void)
{
    ANSL = 0xFF;        //选择对应端口为数字IO功能
	ANSH = 0xFF;        //选择对应端口为数字IO功能
    PAT = 0x00;         //所有IO设为输出低电平
    PBT = 0x00;
    PCT = 0x00;
    PA = 0x00;
    PB = 0x00;
    PC = 0x00;

    PBT4 = 1;           //T31_ETR设为输入
    PBT5 = 1;           //T31_CH1设为输入
    PBT6 = 1;           //T31_CH2设为输入
    PBPU4 = 1;          //使能上拉
    PBPU5 = 1;
    PBPU6 = 1;
}

/*******************************************************
函数名：void isr(void) interrupt
描  述：中断服务程序
输入值：无
输出值：无
返回值：无
*******************************************************/
void isr(void) interrupt
{
    if (MIS1==1 && MIF1==1)        //捕捉1中断
    {
        MIC1 = 1;          //清捕捉1中断标志
        T31IF = 0;         //清定时器总标志位

        PA1 = ~PA1;
        ch1rvalue = T31CH1RH;        //保存捕捉事件时计数器的值
        ch1rvalue = (ch1rvalue<<8) | T31CH1RL;
    }
}

/*******************************************************
函数名：void main(void)
描  述：主函数，捕捉模式
输入值：无
输出值：无
返回值：无
*******************************************************/
void main(void) 
{
    RAMclear();
    GPIOInit();
    T31PRSH = 0x00;         //预分频系数1:16
    T31PRSL = 0x0F;
    T31C2L = 0x00;          //禁止从模式，内部时钟计数
    //T31CH2C = 0x02;         //T31_CH1作为通道2的捕捉管脚，无滤波，无预分频
    T31CH1C = 0x05;         //T31_CH1作为通道1的捕捉管脚，无滤波，预分频1:2
    //T31PINCH = 0x00;        //通道3、通道4端口控制寄存器   
    T31PINCL = 0x02;        //下降沿有效
    CH1E = 1;           //使能通道1捕捉
    MIE1 = 1;           //使能捕捉1中断
    T31IE = 1;          //开启多功能定时器中断   
    MIC1 = 1;           //清捕捉1中断标志
    T31IF = 0;          //清定时器总标志位
    GIE = 1;            //开全局中断
    T31EN = 1;          //使能计数器
    while (1)
    {
        CLRWDT();
    }
}