/*********************************************************
*Copyright (C), 2020, Shanghai Eastsoft Microelectronics Co., Ltd
*文件名:  sleep.c
*作  者:  AE Team
*版  本:  v1.0，编译于iDesigner(v4.2.3.166) + 工具链HRCC(v1.2.0.106)
*日  期:  2020/07/08
*描  述:  睡眠 + 按键中断唤醒演示
          PA1：管脚翻转输出
          PA3：外部中断管脚
          芯片上电复位后PA1管脚翻转10次，然后进入睡眠状态，PA3下降沿唤醒。
          注意：需要在配置字界面选择MRSTEN(PA3)为数字IO。
*备  注:  本软件仅供学习和演示使用，对用户直接引用代码所带来的风险或后果不承担任何法律责任。
**********************************************************/
#include <hic.h>

#define CLRWDT()   {__Asm CWDT;}        //宏定义清狗指令

typedef unsigned char uchar;
typedef unsigned int uint;

/******************************************************
函数名：void RAMclear(void)
描  述：RAM区数据清零，RAM区地址0x0000~0x03FF
输入值：无
输出值：无
返回值：无
*******************************************************/
void RAMclear(void)
{
    for (IAAH=0; IAAH<=0x03; IAAH++)
    {
        for (IAAL=0; IAAL<0xFF; IAAL++)
            IAD = 0x00;
        IAD = 0x00;
    }
}

/******************************************************
函数名：void GPIOInit(void)
描  述：首先初始化所有未用到的IO口为输出低电平
输入值：无
输出值：无
返回值：无
*******************************************************/
void GPIOInit(void)
{
    ANSL = 0xFF;        //选择对应端口为数字IO功能
	ANSH = 0xFF;
    PAT = 0x00;         //所有IO设为输出低电平
    PBT = 0x00;
    PCT = 0x00;
    PA = 0x00;
    PB = 0x00;
    PC = 0x00;
    PAT3 = 1;           //外部中断管脚  
    PAPU3 = 1;          //上拉
}

/**********************************************
函数名：void sleep(void)
描  述：进入IDLE模式
输入值：无
输出值：无
返回值：无
**********************************************/
void sleep(void)
{
    PWRC &= 0x3F;
    PWRC |= 2<<6;        //选择IDLE模式
    __Asm IDLE;     //进入IDLE模式
}

/**********************************************
函数名：isr(void) interrupt
描  述：中断服务程序
输入值：无
输出值：无
返回值：无
**********************************************/
void isr(void) interrupt
{
    if(PIE1==1 && PIF1==1)
    {
        PIF1 = 0;       //清中断标志位
    }
}

/**********************************************
函数名：void main(void) 
描  述：主函数,如果全局中断打开(GIE=1)，则必须要有唤醒源的中断函数，
        如果不打开全局中断(GIE=0),则不必有唤醒源的中断函数。
输入值：无
输出值：无
返回值：无
**********************************************/
void main(void) 
{
    uint i,j;       //循环变量
    RAMclear();
    GPIOInit(); 
    INTC0 &= 0xFC;      //PINT1下降沿中断
    PIE1 = 1;           //打开管脚中断
    //GIE = 1;            //打开全局中断
    while(1)
    {
        CLRWDT();
        for(j = 0;j<10;j++)
        {
            PA1 = 1;
            for(i = 0;i<50000;i++);
            PA1 = 0;
            for(i = 0;i<50000;i++);
        }
        PIF1 = 0;       //睡眠前清中断标志位
        sleep();
    }
}