/*******************************************************
*Copyright(C),2020,Shanghai Eastsoft Microelectronics Co.,Ltd.
*文件名：pwm_multiprecision.c
*作  者：AE Team
*版  本：v1.0，编译于iDesigner(v4.2.3.166) + 工具链HRCC(v1.2.0.106)
*日  期：2020/07/09
*描  述：T21多精度pwm模式，T21_CH0(PA0)和T21_CH1(PA7)输出pwm互补波形，T21_CH2(PB7)输出占空比连续变化的pwm波形
*备  注：本软件仅供学习和演示使用，对用户直接引用代码所带来的风险或后果不承担任何法律责任。
*******************************************************/
#include <hic.h>

#define CLRWDT()   {__Asm CWDT;}        //宏定义清狗指令

unsigned int Duty;        //T21 pwm2占空比

/******************************************************
函数名：void RAMclear(void)
描  述：RAM区数据清零，RAM区地址0x0000~0x03FF
输入值：无
输出值：无
返回值：无
*******************************************************/
void RAMclear(void)
{
    for (IAAH=0; IAAH<=0x03; IAAH++)
    {
        for (IAAL=0; IAAL<0xFF; IAAL++)
            IAD = 0x00;
        IAD = 0x00;
    }
}

/******************************************************
函数名：void GPIOInit(void)
描  述：首先初始化所有未用到的IO口为输出低电平
输入值：无
输出值：无
返回值：无
*******************************************************/
void GPIOInit(void)
{
    ANSL = 0xFF;        //选择对应端口为数字IO功能
	ANSH = 0xFF;
    PAT = 0x00;         //所有IO设为输出低电平
    PBT = 0x00;
    PCT = 0x00;
    PA = 0x00;
    PB = 0x00;
    PC = 0x00;
}

/*******************************************************
函数名：void isr(void) interrupt
描  述：中断服务程序，周期溢出时将T21R的值更新至精度缓冲器(实际起作用，但不可见)。
        所以每次进入中断函数时更新至精度缓冲器中的数是上一次周期溢出时的T21R值
输入值：无
输出值：无
返回值：无
*******************************************************/
void isr(void) interrupt
{
    if (T21PIE==1 && T21PIF==1)        //定时器pwm周期中断
    {
        T21PIF = 0;                //清标志位

        Duty ++;
        if (Duty >= 0x03E8)        //占空比大于周期，重新赋初值
            Duty = 0x0001;

        T21R2H = Duty>>8;    
        T21R2L = Duty;      
    }
}

/*******************************************************
函数名：void main(void)
描  述：主函数，T21_CH0(PA0)和T21_CH1(PA7)输出pwm互补波形，T21_CH2(PB7)输出占空比连续变化的pwm波形
输入值：无
输出值：无
返回值：无
*******************************************************/
void main(void) 
{
    RAMclear();
    GPIOInit();
    T21CL = 0xC0;        //多精度pwm模式
    T21CM = 0x2F;        //T21_CH0输出低有效、T21_CH1输出高有效，预分频1:16
    T21OC = 0x25;        //T21_CH2输出高有效，打开捕捉端口复用功能
    T21PH = 0x03;        //pwm周期
    T21PL = 0xE8;
    T21R0H = 0x01;       //pwm0占空比
    T21R0L = 0x4D;
    T21R1H = 0x01;
    T21R1L = 0x4D;
    Duty = 0x0001;       //pwm2占空比
    T21R2H = Duty>>8;
    T21R2L = Duty;
    T21TR = 1;           //启动pwm输出
    T21PIE = 1;          //打开T21周期2中断    
    T21PIF = 0;          //清标志位
    GIE = 1;             //开全局中断    
    T21EN = 1;           //使能T21
    while (1)
    {
        CLRWDT();
    }
}