#include  <hic.h>
#include  "typedef.h"
#include  "macrodef.h"
#include  "sysinit.h"

/**********************************************
函数名：Init_Uart
描  述：UATR初始化函数
输入值：无
输出值：无
返回值：无
**********************************************/
void  Init_Uart(void)
{
	PAT1=0;	//TX输出
	PAT2=1;	//RX输入
	ANSL|=3<<1;	//数字口
	RX0LEN=0;
	TX0LEN=0;
	BRGH0=1;
	BR0R=103; //波特率9600
	RX0EN=1;
	TX0EN=1;
}
/**********************************************
函数名：Init_Timer
描  述：定时器初始化函数
输入值：无
输出值：无
返回值：无
**********************************************/
void  Init_Timer(void)
{
	T8NC=0x0E;	//欲分频系数1:128
	T8N=0;		
	T8NIE=0;	//不使能中断
	T8NEN=1;
}
/**********************************************
函数名：Init_Ports
描  述：端口初始化函数
输入值：无
输出值：无
返回值：无
**********************************************/
void  Init_Ports(void)
{
	PAT0=1;
	ANSL0=1;
	PAPD0=1;	//BOOTPIN下拉
}
/**********************************************
函数名：Reg_reset
描  述：寄存器复位
输入值：无
输出值：无
返回值：无
**********************************************/
void Reg_reset(void)
{
	PAT0=0xFF;
	ANSL=0;
	ANSH=0;

	T8NC=0;
	T8NEN=0;

	BR0R=0;
	RX0EN=0;
	TX0EN=0;
}
/**********************************************
函数名：Init_MCU
描  述：总初始化函数
输入值：无
输出值：无
返回值：无
**********************************************/
void Init_MCU(void)
{
	Init_Ports();
    Init_Uart();
	Init_Timer();
}