/*******************************************************
*Copyright(C),2020,Shanghai Eastsoft Microelectronics Co.,Ltd.
*文件名：timer_external_clock.c
*作  者：AE Team
*版  本：v1.0，编译于iDesigner(v4.2.3.166) + 工具链HRCC(v1.2.0.106)
*日  期：2020/07/09
*描  述：多功能定时器外部时钟源定时模式，T31_CH1(PB5)输入时钟，计数器溢出翻转PA1。
*备  注：本软件仅供学习和演示使用，对用户直接引用代码所带来的风险或后果不承担任何法律责任。
*******************************************************/
#include <hic.h>

#define CLRWDT()   {__Asm CWDT;}        //宏定义清狗指令

/******************************************************
函数名：void RAMclear(void)
描  述：RAM区数据清零，RAM区地址0x0000~0x03FF
输入值：无
输出值：无
返回值：无
*******************************************************/
void RAMclear(void)
{
    for (IAAH=0; IAAH<=0x03; IAAH++)
    {
        for (IAAL=0; IAAL<0xFF; IAAL++)
            IAD = 0x00;
        IAD = 0x00;
    }
}

/******************************************************
函数名：void GPIOInit(void)
描  述：首先初始化所有未用到的IO口为输出低电平
输入值：无
输出值：无
返回值：无
*******************************************************/
void GPIOInit(void)
{
    ANSL = 0xFF;        //选择对应端口为数字IO功能
	ANSH = 0xFF;
    PAT = 0x00;         //所有IO设为输出低电平
    PBT = 0x00;
    PCT = 0x00;
    PA = 0x00;
    PB = 0x00;
    PC = 0x00;

    PBT4 = 1;                  //T31_ETR设为输入
    PBT5 = 1;                  //T31_CH1设为输入
    PBT6 = 1;                  //T31_CH2设为输入
    PBPU4 = 1;                 //使能上拉
    PBPU5 = 1;
    PBPU6 = 1;
}

/*******************************************************
函数名：void isr(void) interrupt
描  述：中断服务程序
输入值：无
输出值：无
返回值：无
*******************************************************/
void isr(void) interrupt
{
    if (UPIS==1 && UPIF==1)        //定时器溢出中断
    {
        UPIC = 1;        //清溢出标志位，UPIF必须要在T31IF之前清除。
        T31IF = 0;       //清定时器总标志位，UPIF必须要在T31IF之前清除。

        PA1 = ~PA1;
    }
}

/*******************************************************
函数名：void main(void)
描  述：主函数，T31_CH1(PB5)输入时钟，计数器溢出翻转PA1，输入时钟不分频，双沿计数，
        计数器初值0x03E8(1000)。
输入值：无
输出值：无
返回值：无
*******************************************************/
void main(void)
{
    RAMclear();
    GPIOInit();
    T31C2L = 0x47;      //外部时钟模式1，时钟输入T31_CH1，TRC双沿计数
    T31CH2C = 0x00;     //CH2IFS<3:0>=0000,T31_CH2时钟输入禁止数字滤波
    T31CH1C = 0x00;     //CH1IFS<3:0>=0000,T31_CH1时钟输入禁止数字滤波
    T31C0L = 0x00;      //T31CNTLD寄存器无缓冲，写入值立即生效。计数器边沿计数模式，向上计数
    T31CNTLDH = 0x03;   //重装载值，计数器与其匹配时产生事件
    T31CNTLDL = 0xE8;
    T31PRSH = 0x00;     //预分频系数1:1
    T31PRSL = 0x00;
    T31POS = 0x00;      //计数器与T31CNTLD第1次匹配事件时产生溢出中断
    UPIE = 1;       //打开计数溢出中断
    T31IE = 1;      //开启多功能定时器中断
    UPIC = 1;       //清溢出标志位
    T31IF = 0;      //清定时器总标志位
    GIE = 1;        //开启全局中断
    T31EN = 1;      //使能计数器
    while (1)
    {
        CLRWDT();
    }
}
