/*******************************************************
*Copyright(C),2020,Shanghai Eastsoft Microelectronics Co.,Ltd.
*文件名：comparator.c
*作  者：AE Team
*版  本：v1.0，编译于iDesigner(v4.2.3.166) + 工具链HRCC(v1.2.0.106)
*日  期：2020/07/09
*描  述：T21定时器比较模式，T21_CH2(PB7)输出方波
*备  注：本软件仅供学习和演示使用，对用户直接引用代码所带来的风险或后果不承担任何法律责任。
*******************************************************/
#include <hic.h>

#define CLRWDT()   {__Asm CWDT;}        //宏定义清狗指令

/******************************************************
函数名：void RAMclear(void)
描  述：RAM区数据清零，RAM区地址0x0000~0x03FF
输入值：无
输出值：无
返回值：无
*******************************************************/
void RAMclear(void)
{
    for (IAAH=0; IAAH<=0x03; IAAH++)
    {
        for (IAAL=0; IAAL<0xFF; IAAL++)
            IAD = 0x00;
        IAD = 0x00;
    }
}

/******************************************************
函数名：void GPIOInit(void)
描  述：首先初始化所有未用到的IO口为输出低电平
输入值：无
输出值：无
返回值：无
*******************************************************/
void GPIOInit(void)
{
    ANSL = 0xFF;        //选择对应端口为数字IO功能
    ANSH = 0xFF;        
    PAT = 0x00;         //所有IO设为输出低电平
    PBT = 0x00;
    PCT = 0x00;
    PA = 0x00;
    PB = 0x00;
    PC = 0x00;
}

/*******************************************************
函数名：void isr(void) interrupt
描  述：中断服务程序，注意：进入中断服务程序到计数器最终清零之间会有少许延时
输入值：无
输出值：无
返回值：无
*******************************************************/
void isr(void) interrupt
{
    if (T21MIE2==1 && T21MIF2==1)        //定时器比较中断
    {
        T21MIF2 = 0;        //清标志位

        T21L = 0;           //清计数器
        T21H = 0; 

        T21M0 = ~T21M0;     //匹配时改变输出
    }
}

/*******************************************************
函数名：void main(void)
描  述：主函数，比较匹配T21R2翻转COMP2端口电平
输入值：无
输出值：无
返回值：无
*******************************************************/
void main(void) 
{
    RAMclear();
    GPIOInit();
    T21CL = 0x80;        //比较器模式
    T21CM = 0x0F;        //预分频1:16
    T21OC = 0x20;        //打开捕捉端口复用功能
    T21R2H = 0x03;       //比较值
    T21R2L = 0xE8;
    T21MIE2 = 1;         //打开T21比较中断
    T21MIF2 = 0;         //清T21比较中断标志
    GIE = 1;             //开全局中断
    T21EN = 1;           //使能T21
    while (1)
    {
        CLRWDT();
    }
}