/*******************************************************
*Copyright(C),2020,Shanghai Eastsoft Microelectronics Co.,Ltd.
*文件名：capture.c
*作  者：AE Team
*版  本：v1.0，编译于iDesigner(v4.2.3.166) + 工具链HRCC(v1.2.0.106)
*日  期：2020/07/08
*描  述：T21定时器捕捉模式，T21_CH0(PA0)上升沿捕捉，捕捉成功翻转PA1，T21_CH1(PA7)下降沿捕捉，捕捉成功翻转PA6，
        T21_CH2(PB7)双沿捕捉，捕捉成功翻转PA3（PA3需配置为数字输入输出）。capvalue0、capvalue1、capvalue2保存捕捉时捕捉寄存器的值。
*备  注：本软件仅供学习和演示使用，对用户直接引用代码所带来的风险或后果不承担任何法律责任。
*******************************************************/
#include <hic.h>

#define CLRWDT()   {__Asm CWDT;}        //宏定义清狗指令

unsigned int capvalue0,capvalue1,capvalue2;        //变量保存捕捉寄存器的值

/******************************************************
函数名：void RAMclear(void)
描  述：RAM区数据清零，RAM区地址0x0000~0x03FF
输入值：无
输出值：无
返回值：无
*******************************************************/
void RAMclear(void)
{
    for (IAAH=0; IAAH<=0x03; IAAH++)
    {
        for (IAAL=0; IAAL<0xFF; IAAL++)
            IAD = 0x00;
        IAD = 0x00;
    }
}

/******************************************************
函数名：void GPIOInit(void)
描  述：首先初始化所有未用到的IO口为输出低电平
输入值：无
输出值：无
返回值：无
*******************************************************/
void GPIOInit(void)
{
    ANSL = 0xFF;        //选择对应端口为数字IO功能
	ANSH = 0xFF;
    PAT = 0x00;         //所有IO设为输出
    PBT = 0x00;
    PCT = 0x00;
    PA = 0x00;
    PB = 0x00;
    PC = 0x00;

    PAT0 = 1;           //T21_CH0设为输入
    PAT7 = 1;           //T21_CH1设为输入
    PBT7 = 1;           //T21_CH2设为输入
    //PAPD0 = 1;        //使能下拉
    //PAPU7 = 1;        //使能上拉
	//PBPD7 = 1;        //使能下拉
}

/*******************************************************
函数名：void isr(void) interrupt
描  述：中断服务程序
输入值：无
输出值：无
返回值：无
*******************************************************/
void isr(void) interrupt
{
    if (T21MIE0==1 && T21MIF0==1)        //定时器捕捉0中断，上升沿捕捉
    { 
        T21MIF0 = 0;        //清标志位
        capvalue0 = T21R0H;               //保存捕捉寄存器的值
        capvalue0 = (capvalue0<<8) | T21R0L;
        PA1 = ~PA1;
    }

    if (T21MIE1==1 && T21MIF1==1)        //定时器捕捉1中断，下降沿捕捉
    {       
        T21MIF1 = 0;        //清标志位
        capvalue1 = T21R1H;               //保存捕捉寄存器的值
        capvalue1 = (capvalue1<<8) | T21R1L;
        PA6 = ~PA6;
    }

    if (T21MIE2==1 && T21MIF2==1)        //定时器捕捉2中断，双沿捕捉
    {    
        T21MIF2 = 0;        //清标志位
        capvalue2 = T21R2H;               //保存捕捉寄存器的值
        capvalue2 = (capvalue2<<8) | T21R2L;
        PA3 = ~PA3;
    }
}

/*******************************************************
函数名：void main(void)
描  述：主函数，T21_CH0(PA0)和T21_CH1(PA7)输入相同的波形，调试状态下可以直接看到被测波形的周期和占空比
输入值：无
输出值：无
返回值：无
*******************************************************/
void main(void) 
{
    RAMclear();
    GPIOInit();
    T21CL = 0x46;        //捕捉模式，T21_CH0上升沿捕捉，T21_CH1下降沿捕捉
    T21CM = 0xCF;        //T21_CH2双沿捕捉，计数器预分频1:16
    T21OC = 0x25;        //使能T21_CH0(PA0)、T21_CH1(PA7)、T21_CH2(PB7)端口功能
    T21MIE0 = 1;         //打开T21捕捉0中断
    T21MIE1 = 1;         //打开T21捕捉1中断
    T21MIE2 = 1;         //打开T21捕捉2中断
    T21MIF0 = 0;         //清标志位
    T21MIF1 = 0;         //清标志位
    T21MIF2 = 0;         //清标志位
    GIE = 1;             //开全局中断
    T21EN = 1;           //使能T21
    while (1)
    {
        if (T21VIF == 1)        //计数器溢出
        {
            T21VIF = 0;
        }
        CLRWDT();
    }
}